Repository: yaun369/quota-glance-macos
Catalog: Apps/Shared/Localization/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: %@ The reading above is the last one that succeeded.
zh_hans: %@以上是上一次成功读取的数据。

source: %@ weekly quota has reset
zh_hans: %@ 每周额度已重置

source: %@ weekly quota is almost out
zh_hans: %@ 每周额度所剩无几

source: %@ weekly quota is nearly gone
zh_hans: %@ 每周额度即将用尽

source: %@ weekly quota is running low
zh_hans: %@ 每周额度剩余不多

# %@ weekly quota: %@
source: %1$@ weekly quota: %2$@
zh_hans: %1$@ 每周额度当前%2$@

source: %lld places added
zh_hans: 已添加 %lld 处

source: A quota only helps while you can see it. Add one place and you will know what is left without opening the app.
zh_hans: 额度只有在你看得见的时候才有用。挑一个位置加上，之后不用打开 App 就知道还剩多少。

source: Account connected. Fetching the first reading…
zh_hans: 已连接账号，正在获取第一次读数…

source: Account direct read failed
zh_hans: 账号直连失败

source: Accounts
zh_hans: 账号

source: Add ChatGPT account
zh_hans: 添加 ChatGPT 账号

source: Add Claude account
zh_hans: 添加 Claude 账号

source: Added
zh_hans: 已添加

source: After a successful collection the data syncs over through iCloud. Nothing more to set up here.
zh_hans: 采集成功后数据会经 iCloud 自动同步过来，这边不用再做任何设置。

source: AI coding quota
zh_hans: AI 编程额度

source: Allow QuotaGlance in System Settings → General → Login Items, then return here.
zh_hans: 请在「系统设置 → 通用 → 登录项」中允许「码量」，然后返回这里。

source: Always-on places
zh_hans: 常驻位置

source: Automatically check for updates
zh_hans: 自动检查更新

source: Background App Refresh
zh_hans: 后台 App 刷新

source: Cancel
zh_hans: 取消

source: Check for Updates…
zh_hans: 检查更新…

source: Choose which quota this widget or complication shows.
zh_hans: 选择要在小组件或表盘上显示的额度来源。

source: Claude quota
zh_hans: Claude 额度

source: Codex (ChatGPT account)
zh_hans: Codex（ChatGPT 账号）

source: Codex and Claude Code weekly quotas are watched separately. An alert is sent when a quota falls past its threshold; the 5-hour quota never sends one.
zh_hans: 分别监控 Codex 和 Claude Code 的每周额度。额度向下越过对应阈值时发送提醒；5 小时额度不发送提醒。

source: Codex quota
zh_hans: Codex 额度

source: Collapse the steps
zh_hans: 收起步骤

source: Come back here once you have added one and the status turns to Added on its own — nothing to confirm.
zh_hans: 加好之后回到这里，状态会自动变成「已添加」，不用手动确认。

source: Connected
zh_hans: 已连接

source: Connected: %@
zh_hans: 已连接：%@

source: Copied
zh_hans: 已复制

source: Copy download address
zh_hans: 复制下载地址

source: Could not change Login Items
zh_hans: 无法更改登录项

source: Could not disable launch at login: %@. Open Login Items in System Settings and try again.
zh_hans: 无法关闭登录时启动：%@。请在系统设置中打开「登录项」后重试。

source: Could not enable launch at login: %@. Open Login Items in System Settings and try again.
zh_hans: 无法开启登录时启动：%@。请在系统设置中打开「登录项」后重试。

source: Could not update the Claude status line helper: %@
zh_hans: 更新 Claude 状态栏组件失败：%@

source: Demo
zh_hans: 演示

source: Demo mode
zh_hans: 演示模式

source: Demo mode · sample data
zh_hans: 演示模式 · 示例数据

source: Demo mode shows the interface with one fixed set of sample readings. It never writes real data, widgets or alerts, and it turns itself off when you reopen the app.
zh_hans: 演示模式用一份固定的示例数据展示界面，不会写入真实数据、小组件和提醒；重新打开 App 会自动退出。

source: Do you have other devices?
zh_hans: 你还有别的设备吗

source: Done
zh_hans: 完成

source: Drag the downloaded QuotaGlance.app into Applications, then open it.
zh_hans: 把下载到的 QuotaGlance.app 拖进「应用程序」，然后打开它。

source: Enable Launch at Login
zh_hans: 开启登录时启动

source: Exit
zh_hans: 退出

source: Expand the steps to add it
zh_hans: 展开添加步骤

source: Follow the menu bar app’s prompts to complete one collection.
zh_hans: 按菜单栏 App 的提示完成一次采集。

source: General
zh_hans: 通用

source: Heads-up alert
zh_hans: 轻度提醒

source: Help
zh_hans: 帮助

source: iCloud connected
zh_hans: 已连接 iCloud

source: iCloud sync
zh_hans: iCloud 同步

source: iCloud sync failed
zh_hans: iCloud 同步失败

source: If you write code on a Mac too, the menu bar is the closest place of all.
zh_hans: 如果你也在 Mac 上写代码，菜单栏是离你最近的位置。

source: Important alert
zh_hans: 重要提醒

source: Keep QuotaGlance available
zh_hans: 让码量保持可用

source: Last step
zh_hans: 最后一步

source: Launch at Login
zh_hans: 登录时启动

source: Loading
zh_hans: 载入中

source: Loading…
zh_hans: 加载中…

source: Maybe later
zh_hans: 以后再说

source: Move QuotaGlance to Applications and reopen it before enabling launch at login.
zh_hans: 请先将「码量」移到「应用程序」并重新打开，再开启登录时启动。

source: Needs approval
zh_hans: 需要批准

source: No always-on place yet
zh_hans: 还没有常驻位置

source: No data for this service yet. Sign in to it in Settings, or check the collection hints on your Mac.
zh_hans: 这个服务还没有数据：在设置里登录它的账号，或到 Mac 端查看采集提示。

source: No data yet. Sign in to an account in Settings, or open QuotaGlance on your Mac to collect once.
zh_hans: 还没有数据：在设置里登录账号，或在 Mac 上打开「码量」采集一次。

source: No Mac-collected data has arrived yet.
zh_hans: 还没收到 Mac 采集的数据。

source: No quota data yet
zh_hans: 还没有额度数据

source: Not connected
zh_hans: 账号未连接

source: Not now
zh_hans: 暂不开启

source: Not set
zh_hans: 未设置

source: Not synced yet
zh_hans: 尚未同步

source: Nothing collected for this service yet. Sign in to it on your iPhone, or check the hints on your Mac.
zh_hans: 还没有采集到这个服务：在 iPhone 上登录它的账号，或到 Mac 端查看提示。

source: Notification permission
zh_hans: 通知权限

source: Off
zh_hans: 已关闭

source: On
zh_hans: 已开启

source: Once signed in, this iPhone reads your quota directly, with no Mac involved. Credentials stay in this device’s keychain — never in iCloud or a backup.
zh_hans: 登录后 iPhone 可直接读取额度，不依赖 Mac。凭据只保存在本机钥匙串，不会进入 iCloud 或备份。

source: Once signed in, this iPhone reads your quota from the official endpoint directly. Credentials stay in this device’s keychain — never in iCloud or a backup.
zh_hans: 登录后 iPhone 直接向官方接口读取额度。凭据只保存在本机钥匙串，不会进入 iCloud 或备份。

source: Open Login Items
zh_hans: 打开登录项

source: Open on this iPhone
zh_hans: 在 iPhone 上打开

source: Open QuotaGlance automatically after you log in so collection keeps running.
zh_hans: 登录 Mac 后自动打开「码量」，让额度采集持续运行。

source: Open Settings
zh_hans: 去设置

source: Open System Settings
zh_hans: 打开系统设置

source: Open the address below in a browser on your Mac and download the QuotaGlance installer.
zh_hans: 在 Mac 的浏览器里打开下面的地址，下载「码量」安装包。

source: Open the downloaded DMG, drag QuotaGlance into Applications, then open it.
zh_hans: 打开下载的 DMG，将「码量」拖入「应用程序」，然后打开。

source: Option 1: sign in on this iPhone (no Mac needed)
zh_hans: 方式一：在这台 iPhone 上登录（不需要 Mac）

source: Option 2: sync from a Mac
zh_hans: 方式二：从 Mac 同步

source: Overwrite and set up
zh_hans: 覆盖并配置

source: Overwrite the existing Claude Code status line setting?
zh_hans: 覆盖现有的 Claude Code 状态栏配置？

source: Privacy policy
zh_hans: 隐私政策

source: Put QuotaGlance on your Home Screen, Lock Screen or watch face and see what is left without opening the app.
zh_hans: 把码量放到主屏幕、锁屏或表盘上，不打开 App 也能看到还剩多少。

source: Put QuotaGlance where you will see it every day
zh_hans: 把码量放到你每天看得到的地方

source: Quit
zh_hans: 退出

source: Quota progress; the gray portion is what has been used
zh_hans: 额度进度，灰色为已用额度

source: Quota source
zh_hans: 额度来源

source: QuotaGlance
zh_hans: 码量

source: QuotaGlance shows how much Codex and Claude Code quota is left and when it resets. Pick either route below and this page turns into your dashboard.
zh_hans: 「码量」用来查看 Codex 和 Claude Code 还剩多少额度、什么时候重置。下面两种方式任选一种，之后这一页会自动变成额度看板。

source: Read failed
zh_hans: 读取失败

source: Reading quota
zh_hans: 正在读取额度

source: Refresh failed — showing the previous reading
zh_hans: 刷新失败，正在显示旧数据

source: Refresh failed · saved data
zh_hans: 刷新失败 · 显示旧数据

source: Refresh now
zh_hans: 立即刷新

source: Restricted
zh_hans: 受限制

source: Retry
zh_hans: 重试

source: Runs out first
zh_hans: 最先见底

# Runs out first: %@ %@, %@
source: Runs out first: %1$@ %2$@, %3$@
zh_hans: 最先见底：%1$@ %2$@，%3$@

source: See your AI coding quota and when it resets, at a glance.
zh_hans: 随时查看 AI 编程额度与重置时间。

source: Sends an alert once a Codex or Claude Code weekly quota has reset.
zh_hans: 在 Codex 或 Claude Code 的每周额度重置后发送提醒。

source: Service
zh_hans: 服务

source: Set up for me
zh_hans: 一键配置

source: Settings
zh_hans: 设置

source: Setup failed
zh_hans: 配置失败

source: Setup failed: %@
zh_hans: 配置失败：%@

source: Show sample data
zh_hans: 查看演示数据

source: Show the steps
zh_hans: 查看添加步骤

source: Shows the interface with one fixed set of sample readings, for a look around or a screenshot. It changes no real data and leaves widgets, the watch and alerts alone; reopening the app turns it off.
zh_hans: 用一份固定的示例数据展示界面，方便先看效果或截图。演示期间不会修改真实数据，也不影响小组件、手表和提醒；重新打开 App 会自动退出。

source: Sign in
zh_hans: 登录账号

source: Sign in again
zh_hans: 重新登录

source: Sign in on your iPhone first, or open QuotaGlance on your Mac to collect once.
zh_hans: 请先在 iPhone 上登录账号，或在 Mac 上打开「码量」采集一次。

source: Sign in with ChatGPT
zh_hans: 登录 ChatGPT 账号

source: Sign in with Claude
zh_hans: 登录 Claude 账号

source: Sign out
zh_hans: 退出

source: Sign your Mac and this iPhone in to the same iCloud account.
zh_hans: Mac 和这台 iPhone 登录同一个 iCloud 账号。

source: Sign-in expired
zh_hans: 登录已过期

source: Sign-in expired · saved data
zh_hans: 登录已过期 · 显示旧数据

source: Sign-in failed
zh_hans: 登录失败

source: Source: %@
zh_hans: 数据源：%@

source: Sync failed
zh_hans: 同步失败

source: Syncing from your iPhone or iCloud…
zh_hans: 正在从 iPhone 或 iCloud 同步…

source: Tap to open QuotaGlance and sign in, or sync from a Mac.
zh_hans: 轻点打开「码量」，登录账号或从 Mac 同步。

source: The %@ weekly quota has reset. You can carry on.
zh_hans: %@ 的每周额度已经重置，可以继续使用。

source: The Mac version needs macOS 14 or later.
zh_hans: Mac 版需要 macOS 14 或更高版本。

source: Turn on
zh_hans: 开启

source: Unavailable
zh_hans: 不可用

source: Unknown
zh_hans: 未知

source: Updates
zh_hans: 更新

source: Updating…
zh_hans: 更新中…

source: Urgent alert
zh_hans: 紧急提醒

source: User guide
zh_hans: 使用说明

source: Waiting for browser authorization…
zh_hans: 等待浏览器授权…

source: Weekly quota alert thresholds (percent remaining)
zh_hans: 每周额度提醒阈值（剩余百分比）

source: Weekly quota reset alert
zh_hans: 每周额度重置提醒

source: Which service do you want to connect?
zh_hans: 要连接哪个服务？

source: With this off, quotas are only checked while the app is open, so alerts may arrive late or not at all.
zh_hans: 关闭后只有打开 App 时才会检查额度，可能收不到及时的提醒。

source: You will also be asked once, the first time a quota reading arrives.
zh_hans: 首次获取到额度数据时也会询问一次。

source: Your existing ~/.claude/settings.json is backed up to ~/.agent-quota first, so you can restore it by hand later.
zh_hans: 原有的 ~/.claude/settings.json 会先备份到 ~/.agent-quota，之后可以手动恢复。

source: Your quota
zh_hans: 你的额度

source: Your sign-in has expired. Please sign in again.
zh_hans: 登录已失效，请重新登录。
